# Proyecto shark attacks Ironhack:

-Analisis de los datos y limpieza (planteamiento hipotesis)

Sergio Molina Biaggini

1-Analisis de los datos

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import seaborn as sns
#Importo las librerias que voy a usar o creo que puedo usar en mi proyecto

In [2]:
import sys
sys.path.append("../")
from src.funciones_shark import * 
#Con estas lineas de codigo , puedo usar las funciones ya definidas en mi carpeta SRC

In [3]:
shark = pd.read_csv('../data/attacks.csv',encoding = "ISO-8859-1")
#pd.options.display.max_rows = 99 
#pd.options.display.max_columns = 99
shark.head(4) #Me muestro las primeras n lineas del dataframe, es la primera observación

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,2018.06.25,25-Jun-2018,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,...,White shark,"R. Collier, GSAF",2018.06.25-Wolfe.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.25,2018.06.25,6303.0,NaN,NaN
1,2018.06.18,18-Jun-2018,2018.0,Unprovoked,USA,Georgia,"St. Simon Island, Glynn County",Standing,Adyson McNeely,F,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.18-McNeely.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.18,2018.06.18,6302.0,NaN,NaN
2,2018.06.09,09-Jun-2018,2018.0,Invalid,USA,Hawaii,"Habush, Oahu",Surfing,John Denges,M,...,NaN,"K.McMurray, TrackingSharks.com",2018.06.09-Denges.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.09,2018.06.09,6301.0,NaN,NaN
3,2018.06.08,08-Jun-2018,2018.0,Unprovoked,AUSTRALIA,New South Wales,Arrawarra Headland,Surfing,male,M,...,2 m shark,"B. Myatt, GSAF",2018.06.08-Arrawarra.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,2018.06.08,2018.06.08,6300.0,NaN,NaN

In [4]:
shark.sample(4) 
#Podemos observar que aunque los primeros datos parecen buenos, en la muestra hay muchos valores NaN, no utiles

,Case Number,Date,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
23160,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2442,1994.04.03,03-Apr-1994,1994.0,Unprovoked,USA,Florida,"Miami Beach, Dade County",Freediving for seashells,Raul Tozo,M,...,NaN,"Miami Herald, 4/5/1994",1994.04.03-Tozo.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1994.04.03,1994.04.03,3861.0,NaN,NaN
8253,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9659,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [5]:
shark.describe()
#Me aporta información estadistica basica, en principio no me dice mucho, pero lo tendre de apoyo,
#Y de punto de inicio de mi exploración de datos

              Year  original order
count  6300.000000     6309.000000
mean   1927.272381     3155.999683
std     281.116308     1821.396206
min       0.000000        2.000000
25%    1942.000000     1579.000000
50%    1977.000000     3156.000000
75%    2005.000000     4733.000000
max    2018.000000     6310.000000

In [6]:
shark.info()
#Nuevamente información basica sobre que tipo de datos tengo y como se llaman las columnas
#De primeras veo que las columnas Unammed 22 y 23 no tienen apenas valore no NaN(las eliminare)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25723 entries, 0 to 25722
Data columns (total 24 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Case Number             8702 non-null   object
 1   Date                    6302 non-null   object
 2   Year                    6300 non-null   float64
 3   Type                    6298 non-null   object
 4   Country                 6252 non-null   object
 5   Area                    5847 non-null   object
 6   Location                5762 non-null   object
 7   Activity                5758 non-null   object
 8   Name                    6092 non-null   object
 9   Sex                     5737 non-null   object
 10  Age                     3471 non-null   object
 11  Injury                  6274 non-null   object
 12  Fatal (Y/N)             5763 non-null   object
 13  Time                    2948 non-null   object
 14  Species                 3464 non-null   object
 15  Investigator or Source  6285 non-null   object
 16  pdf                     6302 non-null   object
 17  href formula            6301 non-null   object
 18  href                    6302 non-null   object
 19  Case Number.1           6302 non-null   object
 20  Case Number.2           6302 non-null   object
 21  original order          6309 non-null   float64
 22  Unnamed: 22             1 non-null      object
 23  Unnamed: 23             2 non-null      object
dtypes: float64(2), object(22)
memory usage: 4.7+ MB

In [7]:
shark.shape 
#Me da las dimensiones de mi dataframe, numero de filas y columnas

(25723, 24)

2-Limpieza y filtrado de datos

In [8]:
shark.columns
#Obtengo los nombres de todas las columnas

Index(['Case Number', 'Date', 'Year', 'Type', 'Country', 'Area', 'Location',
       'Activity', 'Name', 'Sex ', 'Age', 'Injury', 'Fatal (Y/N)', 'Time',
       'Species ', 'Investigator or Source', 'pdf', 'href formula', 'href',
       'Case Number.1', 'Case Number.2', 'original order', 'Unnamed: 22',
       'Unnamed: 23'],
      dtype='object')

In [9]:
def new_name(df):
    """función para que los nombres de las columnas no tengan valores raros"""
    new = []
    for col in df.columns:
        print(col)
        a = col.strip().lower()
        b = a.replace('.','_')
        new.append(b)    
    return new

In [10]:
shark.columns=new_name(shark)
#Dejo mas bonitos los nombres de mis columnas

Case Number
Date
Year
Type
Country
Area
Location
Activity
Name
Sex
Age
Injury
Fatal (Y/N)
Time
Species
Investigator or Source
pdf
href formula
href
Case Number.1
Case Number.2
original order
Unnamed: 22
Unnamed: 23

In [11]:
for col in shark.columns:
    nulos = np.mean(shark[col].isnull())
    print('{} - {}%'.format(col, round(nulos*100))) 
#me saca los porcentajes de valores NaN en mis columnas, 
#me aporta información de la calidad de las mismas

case number - 66%
date - 76%
year - 76%
type - 76%
country - 76%
area - 77%
location - 78%
activity - 78%
name - 76%
sex - 78%
age - 87%
injury - 76%
fatal (y/n) - 78%
time - 89%
species - 87%
investigator or source - 76%
pdf - 76%
href formula - 76%
href - 76%
case number_1 - 76%
case number_2 - 76%
original order - 75%
unnamed: 22 - 100%
unnamed: 23 - 100%

In [12]:
shark1 = shark.dropna(how="all")#elimina todas las filas en las que todos los datos son NaN
#shark1 = shark.fillna({sex:0}) --- me llenaria los valores NaN de sex con el valor 0
shark1.shape #se observa claramente como ahora el numero de filas es muy inferior a nuestro dataframe original

(8703, 24)

In [13]:
for col in shark1.columns:
    nulo = np.mean(shark1[col].isnull())
    print('{} - {}%'.format(col, round(nulo*100))) 
#Con la elimininación de estas filas de valores nulos
#Me baja el porcentaje de nulos presente por cada columna, mejoro mis datos

case number - 0%
date - 28%
year - 28%
type - 28%
country - 28%
area - 33%
location - 34%
activity - 34%
name - 30%
sex - 34%
age - 60%
injury - 28%
fatal (y/n) - 34%
time - 66%
species - 60%
investigator or source - 28%
pdf - 28%
href formula - 28%
href - 28%
case number_1 - 28%
case number_2 - 28%
original order - 28%
unnamed: 22 - 100%
unnamed: 23 - 100%

In [14]:
shark1 = shark1.drop(columns = ['original order','case number_2','case number_1','href','href formula','pdf',
                                'investigator or source','unnamed: 22','unnamed: 23','name',])
#Elimino estas columnas de poco interes para mis hipotesis y prosigo con la limpieza

In [15]:
shark1.drop_duplicates(inplace=True) 
#Con esto elimino todas las filas en las que tengamos datos duplicados

In [16]:
shark1.shape 
#Ahora mi dataframe tiene menos columnas y menos filas, pero los datos que quedan aportan mejor información que antes

(6304, 14)

In [17]:
shark1.columns = ['Number','Date', 'Year', 'Type', 'Country', 'Area','Location','Activity',
                   'Sex', 'Age','Injury', 'Fatal', 'Time', 'Species']
#Cambio los nombres de mis actuales columnas para que esten mas claros y me sea mas sencillo trabajar

In [18]:
#shark1.dropna(subset=['Number','Date', 'Year', 'Type', 'Country', 'Area','Location','Activity',
                  # 'Sex', 'Age','Injury', 'Fatal', 'Time', 'Species'],inplace=True)
#Elimino las filas con valores nulos de cada columna que tengo renombrada

In [19]:
shark1.dropna(subset=['Species'],inplace=True) #Elimino los valores nulos de la columna en cuestión

In [20]:
shark1 = shark1.drop(columns = ['Number','Area','Location','Age','Injury']) 
#A mis columnas previamente eliminadas añado estas nuevas

Comienzo la limpieza:

In [21]:
shark1['Fatal'].value_counts() 
#Analizo Fatal, y trato de limpiar los datos

N          2497
Y           427
UNKNOWN      17
 N            5
M             1
2017          1
Name: Fatal, dtype: int64

In [22]:
shark1['Fatal'] = shark1['Fatal'].str.strip() #Convierto todo en strings para poder comparar 
shark1['Fatal'] = shark1['Fatal'].str.upper() #Paso todo a mayusculas
shark1['Fatal'].replace(['M','2017'], np.nan, inplace=True) #Cambio los valores anomalos por NaN
shark1['Fatal'].replace(['UNKNOWN'], np.nan, inplace=True) 
shark1['Fatal'].replace(['N'], 'NO', inplace=True) #Cambio todas mis N por NO
shark1['Fatal'].replace(['Y'], 'YES', inplace=True) #Cambio todas mis Y por YES

In [23]:
shark1['Fatal'].value_counts() 
#La columna limpia queda dividida en yes or no como respuesta a la pregunta de si el ataque ha sido fatal o la persona ha sobrevivido

NO     2502
YES     427
Name: Fatal, dtype: int64

In [24]:
shark1['Sex'].value_counts() 
#Paso a analizar la columna sex y a limpiarla

M      2770
F       370
N         2
M         1
lli       1
.         1
Name: Sex, dtype: int64

In [25]:
shark1['Sex'] = shark1['Sex'].str.strip()
shark1['Sex'].replace(['N','.','lli'],np.nan,inplace=True)
shark1['Sex'].replace(['M'], 'Male', inplace=True)
shark1['Sex'].replace(['F'], 'Female', inplace=True)
shark1['Sex'].value_counts() 
#Ahora mis datos estan agrupados en dos categorias solo ; Hombre o Mujer,proceso similar al anterior

Male      2771
Female     370
Name: Sex, dtype: int64

In [26]:
#shark1.dropna(subset=['Country','Species'],inplace=True)

In [27]:
shark1["Sharks"] = shark1["Species"].apply(blanco) #aplico mi funcion que se encuentra en SRC
shark1.sample(5)

,Date,Year,Type,Country,Activity,Sex,Fatal,Time,Species,Sharks
565,Reported 12-Apr-2014,2014.0,Boat,SOUTH AFRICA,Shark watching,NaN,NO,NaN,White shark,White shark
3327,17-Aug-1972,1972.0,Unprovoked,USA,Spearfishing,Male,NO,NaN,2.4 m [8'] shark,Other sharks
2717,22-Aug-1988,1988.0,Provoked,USA,Diving in Sharkey's Reef restaurants aquarium,Male,NO,NaN,"Tiger shark, 1.8 m [6']",Other sharks
1621,27-Nov-2004,2004.0,Unprovoked,SOUTH AFRICA,Surfing,Male,NO,18h00,Raggedtooth shark,Other sharks
368,03-Sep-2015,2015.0,Unprovoked,USA,NaN,Male,NO,16h00,4' shark?,Other sharks

In [28]:
shark1["Sharks"].value_counts() 
#Ahora tras aplicar mi funcion blanco, distingo entre que ataques han sido a manos de tiburones blancos y cuales no
#Dor por limpiada la columna species de la que ya no voy a usar más datos y la cual procedere a eliminar

Other sharks    2797
White shark      667
Name: Sharks, dtype: int64

In [29]:
shark1['Type'].value_counts() 
#No son excesivas las categorias, paso a su limpieza

Unprovoked      2241
Invalid          526
Provoked         412
Boating          136
Boat             112
Sea Disaster      35
Questionable       2
Name: Type, dtype: int64

In [30]:
shark1['Type'] = shark1['Type'].str.upper()
shark1['Type'].replace('BOAT\w*','BOAT',regex=True,inplace=True)
shark1['Type'].replace('QUESTIONABLE','DKNOW',inplace=True)
shark1['Type'].value_counts() #Limpio mis datos de type

UNPROVOKED      2241
INVALID          526
PROVOKED         412
BOAT             248
SEA DISASTER      35
DKNOW              2
Name: Type, dtype: int64

In [31]:
shark1.dropna(subset=['Sex','Fatal','Type'],inplace=True) 
#Elimino los residuos de NaN que quedaban en estas columnas

In [32]:
shark1 #veo como va la cosa

,Date,Year,Type,Country,Activity,Sex,Fatal,Time,Species,Sharks
0,25-Jun-2018,2018.0,BOAT,USA,Paddling,Female,NO,18h00,White shark,White shark
3,08-Jun-2018,2018.0,UNPROVOKED,AUSTRALIA,Surfing,Male,NO,NaN,2 m shark,Other sharks
4,04-Jun-2018,2018.0,PROVOKED,MEXICO,Free diving,Male,NO,NaN,"Tiger shark, 3m",Other sharks
6,03-Jun-2018,2018.0,UNPROVOKED,BRAZIL,Swimming,Male,YES,Late afternoon,Tiger shark,Other sharks
7,27-May-2018,2018.0,UNPROVOKED,USA,Fishing,Male,NO,NaN,"Lemon shark, 3'",Other sharks
...,...,...,...,...,...,...,...,...,...,...
6276,Early 1930s,0.0,UNPROVOKED,BELIZE,Standing,Male,YES,NaN,12' tiger shark,Other sharks
6293,Before 1906,0.0,UNPROVOKED,AUSTRALIA,Fishing,Male,YES,NaN,Blue pointer,Other sharks
6294,Before 1906,0.0,UNPROVOKED,AUSTRALIA,Fishing,Male,YES,NaN,Blue pointer,Other sharks
6295,Before 1906,0.0,UNPROVOKED,AUSTRALIA,Fishing,Male,YES,NaN,Blue pointers,Other sharks
6296,Before 1906,0.0,UNPROVOKED,AUSTRALIA,Swimming,Male,YES,NaN,Said to involve a grey nurse shark that leapt ...,Other sharks

In [33]:
temp_lst = [] #creo variable vacia par almacenar mis meses
for row in shark1['Date']: #recorro todas las filas de la columna date
    temp_row = ''.join(re.findall('\-[A-Za-z]{3}\-',row)).lower() #uso regex para encontrar la parte que me interesa de los datos
    temp_row = re.sub('\-','',temp_row) #Con regex también elimino lo que no me interesa de los datos 
            
    if temp_row == '':
        temp_row = np.nan

    temp_lst.append(temp_row)

shark1['Month'] = temp_lst 
#Creo una nueva columna en mi dataframe con los meses que he conseguido capturar antes de entre mis datos

In [34]:
shark1['Month'].value_counts() 
#Observo como quedan los datos que he conseguido y veo si necesitan una segunda limpieza

jul       267
aug       243
sep       237
jan       225
jun       221
oct       203
apr       194
mar       180
feb       171
dec       171
nov       171
may       170
sepsep      1
marmar      1
Name: Month, dtype: int64

In [35]:
shark1.dropna(subset=['Month'], inplace=True) 
#Elimino mis NaN de entre los datos de los meses

In [36]:
for row in shark1['Month']:
    if len(row) > 3:
        shark1['Month'].replace(row,row[:3], inplace=True) #Busco meses con mas de 3 letras que serian los fallos 
    elif row == 'jut':
        shark1['Month'].replace(row,'jun', inplace=True) #O con incorrecciones ortograficas

In [37]:
shark1['Month'].value_counts(dropna=False) 
#Ahora mis datos ya estan limpios

jul    267
aug    243
sep    238
jan    225
jun    221
oct    203
apr    194
mar    181
feb    171
dec    171
nov    171
may    170
Name: Month, dtype: int64

In [38]:
shark1 = shark1.drop(columns = ['Time','Species']) #Tras a ver profundizado en mi analisis elimino 
                                                          #estas tres columnas, no trabajare con ellas
shark1.dropna(subset=['Activity','Country'],inplace=True) #Elimino NaN de estas filas nuevamente

In [39]:
shark1.sample(10)

,Date,Year,Type,Country,Activity,Sex,Fatal,Sharks,Month
2512,02-Jan-1993,1993.0,UNPROVOKED,USA,Surfing,Male,NO,White shark,jan
623,12-Sep-2013,2013.0,UNPROVOKED,USA,Surfing,Female,NO,Other sharks,sep
1129,06-Mar-2009,2009.0,PROVOKED,BAHAMAS,Spearfishing,Male,NO,Other sharks,mar
4698,01-Nov-1942,1942.0,UNPROVOKED,SOUTH AFRICA,Swimming,Male,YES,White shark,nov
1032,19-Apr-2010,2010.0,UNPROVOKED,USA,Surfing,Male,NO,Other sharks,apr
4,04-Jun-2018,2018.0,PROVOKED,MEXICO,Free diving,Male,NO,Other sharks,jun
1404,25-Jan-2007,2007.0,UNPROVOKED,NEW CALEDONIA,Spearfishing (free diving),Male,NO,Other sharks,jan
1390,09-Apr-2007,2007.0,UNPROVOKED,NEW CALEDONIA,Surfing,Male,NO,Other sharks,apr
1591,02-May-2005,2005.0,UNPROVOKED,USA,Surfing,Male,NO,Other sharks,may
2636,06-May-1990,1990.0,UNPROVOKED,SOUTH AFRICA,Resting on surfboard,Male,NO,White shark,may

In [40]:
#shark1.loc[(shark1['Activity'] == 'Nan')] 
shark1['Activity'].value_counts() #Parece que no aparecen un gran numero de Nan entre los valores

Surfing                                                                 536
Swimming                                                                301
Spearfishing                                                            187
Fishing                                                                 160
Wading                                                                   67
                                                                       ...
Hookah diving                                                             1
Swimming, after falling off towed kneeboard                               1
Removing shark from tank in nightclub                                     1
Jumped off rocks into white water                                         1
Accidentally thrown overboard & treading water while awaiting rescue      1
Name: Activity, Length: 599, dtype: int64

In [41]:
shark1[shark1['Year'].notnull()]['Year'].value_counts().sample(10)

1882.0     1
1961.0    42
1943.0     3
1996.0    30
1960.0    31
1860.0     1
2006.0    51
1990.0    23
1968.0    14
1977.0    11
Name: Year, dtype: int64

In [42]:
#limpio year
shark1['Year'].replace(0,np.nan,inplace=True)
shark1['Year'] = pd.to_numeric(shark1['Year'], errors='coerce', downcast='integer')
shark1['Year'].value_counts().sample(10)

1882     1
1930     3
1911     1
1892     2
2018    37
1968    14
1914     4
1963    35
1971    12
1932     5
Name: Year, dtype: int64

In [43]:
shark1 = shark1.drop(columns = ['Date']) 
#Elimino date, me quedo con la columna limpia de year como referencia tempora y con los meses

In [44]:
#shark1 = shark1.set_index('Year') #me pone Year en index -No me interesa al final

In [45]:
shark1['Country'].unique() #trato de dejar mejor los datos sobre paises

array(['USA', 'AUSTRALIA', 'MEXICO', 'BRAZIL', 'ENGLAND', 'COSTA RICA',
       'MALDIVES', 'SOUTH AFRICA', 'THAILAND', 'BAHAMAS', 'ECUADOR',
       'NEW CALEDONIA', 'MALAYSIA', 'CUBA', 'NEW ZEALAND', 'SPAIN',
       'EGYPT', 'REUNION', 'UNITED KINGDOM', 'PHILIPPINES', 'INDONESIA',
       'COLUMBIA', 'FRENCH POLYNESIA', 'UNITED ARAB EMIRATES', 'JAPAN',
       'ST. MARTIN', 'FRANCE', 'BELIZE', 'JAMAICA', 'TONGA', 'SCOTLAND',
       'TAIWAN', 'PAPUA NEW GUINEA', 'RUSSIA', 'SEYCHELLES',
       'TURKS & CAICOS', 'MALTA', 'VIETNAM', 'MOZAMBIQUE', 'GUAM',
       'CROATIA', 'PANAMA', 'SOLOMON ISLANDS', 'NORWAY', 'Sierra Leone',
       'FIJI', 'ATLANTIC OCEAN', 'ST. MAARTIN', 'GRAND CAYMAN', 'CHINA',
       'VANUATU', 'SOUTH KOREA', 'MADAGASCAR', ' TONGA', 'URUGUAY',
       'VENEZUELA', 'INDIA', 'MICRONESIA', 'CANADA', 'OKINAWA',
       'TANZANIA', 'MARSHALL ISLANDS', 'MAURITIUS', 'EGYPT / ISRAEL',
       'HONG KONG', 'CHILE', 'CARIBBEAN SEA', 'ITALY', 'Fiji', 'KENYA',
       'PORTUGAL', 'SOUTH CHINA SEA', 'ISRAEL', 'WESTERN SAMOA',
       'BRITISH ISLES', 'PALAU', 'NEW BRITAIN', 'JOHNSTON ISLAND',
       'NEW GUINEA', 'RED SEA', 'FEDERATED STATES OF MICRONESIA',
       'GREECE', 'BRITISH WEST INDIES', 'MID ATLANTIC OCEAN',
       'PERSIAN GULF', 'BERMUDA', 'NORTH PACIFIC OCEAN', 'NORTH SEA',
       'AMERICAN SAMOA', 'ANDAMAN / NICOBAR ISLANDAS', 'PACIFIC OCEAN',
       'SENEGAL', 'MONTENEGRO', 'YEMEN', 'ARGENTINA',
       'NETHERLANDS ANTILLES', 'EL SALVADOR', 'IRAN', 'INDIAN OCEAN',
       'SOUTHWEST PACIFIC OCEAN', 'SOUTH ATLANTIC OCEAN', 'IRAQ', 'HAITI',
       'NORTH ATLANTIC OCEAN', 'CYPRUS', 'GEORGIA'], dtype=object)

In [46]:
shark1['Country'] = shark1['Country'].str.strip()
shark1['Country'] = shark1['Country'].str.upper()
shark1['Country'].replace(to_replace=['.*OCEAN','.* SEA'],value=np.nan,regex=True,inplace=True) 
#Elimino los ataques en mares y oceanos pues no son paises

In [47]:
shark1['Country'].unique() #Datos de paises limpios

array(['USA', 'AUSTRALIA', 'MEXICO', 'BRAZIL', 'ENGLAND', 'COSTA RICA',
       'MALDIVES', 'SOUTH AFRICA', 'THAILAND', 'BAHAMAS', 'ECUADOR',
       'NEW CALEDONIA', 'MALAYSIA', 'CUBA', 'NEW ZEALAND', 'SPAIN',
       'EGYPT', 'REUNION', 'UNITED KINGDOM', 'PHILIPPINES', 'INDONESIA',
       'COLUMBIA', 'FRENCH POLYNESIA', 'UNITED ARAB EMIRATES', 'JAPAN',
       'ST. MARTIN', 'FRANCE', 'BELIZE', 'JAMAICA', 'TONGA', 'SCOTLAND',
       'TAIWAN', 'PAPUA NEW GUINEA', 'RUSSIA', 'SEYCHELLES',
       'TURKS & CAICOS', 'MALTA', 'VIETNAM', 'MOZAMBIQUE', 'GUAM',
       'CROATIA', 'PANAMA', 'SOLOMON ISLANDS', 'NORWAY', 'SIERRA LEONE',
       'FIJI', nan, 'ST. MAARTIN', 'GRAND CAYMAN', 'CHINA', 'VANUATU',
       'SOUTH KOREA', 'MADAGASCAR', 'URUGUAY', 'VENEZUELA', 'INDIA',
       'MICRONESIA', 'CANADA', 'OKINAWA', 'TANZANIA', 'MARSHALL ISLANDS',
       'MAURITIUS', 'EGYPT / ISRAEL', 'HONG KONG', 'CHILE', 'ITALY',
       'KENYA', 'PORTUGAL', 'ISRAEL', 'WESTERN SAMOA', 'BRITISH ISLES',
       'PALAU', 'NEW BRITAIN', 'JOHNSTON ISLAND', 'NEW GUINEA',
       'FEDERATED STATES OF MICRONESIA', 'GREECE', 'BRITISH WEST INDIES',
       'PERSIAN GULF', 'BERMUDA', 'AMERICAN SAMOA',
       'ANDAMAN / NICOBAR ISLANDAS', 'SENEGAL', 'MONTENEGRO', 'YEMEN',
       'ARGENTINA', 'NETHERLANDS ANTILLES', 'EL SALVADOR', 'IRAN', 'IRAQ',
       'HAITI', 'CYPRUS', 'GEORGIA'], dtype=object)

In [48]:
shark1.sample(4) #El dataframe limpio presenta este aspecto,en base a el intentare demostrar mis hipotesis

,Year,Type,Country,Activity,Sex,Fatal,Sharks,Month
1342,2007,PROVOKED,USA,Diving,Male,NO,Other sharks,aug
2107,1999,UNPROVOKED,MARSHALL ISLANDS,Fishing,Male,NO,Other sharks,aug
886,2011,UNPROVOKED,SEYCHELLES,Swimming or Snorkeling,Male,YES,Other sharks,aug
1505,2006,BOAT,USA,Kayaking,Male,NO,Other sharks,feb

In [49]:
shark1.shape

(2398, 8)

In [50]:
shark1.to_csv("shark_limpio.csv",index=False) 
#Guardo el dataframe ya limpio como un csv